# include <iostream>
# include <ctime>
# include <conio.h>
using namespace std;
int main()
{
	srand( time(NULL));
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*Дано одновимірний масив. Знайти найбільший та найменший елементи масиву та поміняти їх у масиві місцями*/
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	const int n = 7;
	int a4[n];
	int max, min, imax, imin;
//------------------Вивід масива на екран
	cout << " **** Array a4[n] ****  " << n << endl;
	cout << endl;
	for (int i = 0; i < n; i++)
	{
		a4[i] = rand() % 10;
		cout << a4[i] << "   ";
//------------------Визначення максимального і мінімального елементів масива і їх індексів
		max = min = a4[0];
		imax = imin = 0;
		for (int i = 1; i < n; i++)
		{
			if (a4[i] > max)
			{
				max = a4[i];
				imax = i;

			}
			else if (a4[i] < min)
			{
				min = a4[i];
				imin = i;
			}
		}
	}
			
	
//------------------------Перестановка max і min елементів
		a4[imin] = max;
		a4[imax] = min;

//----------------------Вивід max, min, imax, imin
	
	cout << "\n \t MAX=  "<<max<<" min= "<< min << endl;
	cout << "\t imax= "<<imax+1<<" imin= "<< imin+1 << endl;
	cout << endl;
//-----------------------------Вивід зміненого масиву a4[n]
	cout << " ++++ Changed ARRAY a4[n] ++++  " << n << endl;
	for (int i = 0; i < n; i++)
	{
		cout << a4[i] << "   ";
	}
	cout << "\n**********************************************" << endl;
	cout << endl;
	cout << endl;

//////////////////////////////////////////////////////////////////////////////////////
/*Дано одновимірний масив. Знайти суму елементів з непарними індексами.*/
//////////////////////////////////////////////////////////////////////////////////////
	const int k = 7;
	int sum = 0;
	int a5[k];
//-----------Вивід масива на екран
	cout << " **** ARRAY a5[k] ****  " << k << endl;
	cout << endl;
	for (int i=0; i < k; i++)
	{	a5[i] = rand() % 10;
		cout << a5[i] << "   ";
//----------------------------Підрахунок суми елементів з непарними індексами
		if (i % 2 != 0)
		{
			sum += a5[i];
			
		}

	}
//----------------------------Вивід суми елементів з непарними індексами	
	cout << "\nAmount of odd items= " << sum << endl;
	cout << "\n**********************************************" << endl;
	cout << endl;

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/* Дано одновимірний масив. Поміняти місцями перший елемент з другим, третій з четвертим, і т.д. Вивести змінений масив на екран. 	*/
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


	const int j = 8;
	int a6[j];
//---------------Вивід масива на екран
	cout << " **** ARRAY a6[j] ****  " << j << endl;
	cout << endl;
	for (int i = 0; i < j; i++)
	{
		a6[i] = rand() % 10;
		cout << a6[i] << "   ";
				
	}
//-----------Поміняти місцями перший елемент з другим
	cout << endl;
	for (int i = 0; i<j; i+=2)
	{
		int temp = a6[i];
		a6[i] = a6[i+1];
		a6[i+1] = temp;
		
	}
	cout << endl;
 //------------Вивести змінений масив на екран.
	cout << " **** Changed ARRAY a6[j] ****  " << j << endl;
	for (int i = 0; i < j; i++)
	{
		cout << a6[i] << "   ";
	}
	cout << "\n**********************************************" << endl;
	cout << endl;
	//-----------вивід масива на екран

	system("pause");
	return 0;
}