# include <iostream>;
# include <ctime>
using namespace std;
int main()

{
	srand(unsigned(time(NULL)));
	setlocale(LC_ALL, "ru");

	const int SIZE = 10;
	int arr[SIZE];
	int i, j, tmp=0;
	
	//=============================================
	
	for (i = 0; i < SIZE; i++) 
	{
		arr[i] = rand() % 10+1;
	}

	//=============================================
	cout << "========COUT  Array 1 ===============" << endl;
	for (int i = 0; i < SIZE; i++)
	{
		cout << arr[i] << "  ";
	}
	cout << endl;

	//====================================

	//Алгоритм методом вставки

	// Сортування від більшого до меншого
	for (i = 1; i < SIZE; i++)
	{
		tmp = arr[i];

		for (j = i - 1; j >= 0 && arr[j] > tmp; j--) {
			arr[j + 1] = arr[j];
		}
		arr[j + 1] = tmp;
	}
	//=============================================
	cout << "========COUT  Array 2 ===============" << endl;
	for (int i = 0; i < SIZE; i++)
	{
		cout <<"["<<i<<"] "<< arr[i] << endl;
	}
	
	cout <<"|||||||||||||||||||||||||||||||||||||||||||||||||||||"<<endl;
	//========================================================
	

	/*Дано масив А. Утворити реверс масиву А у масиві В(тобто перший елемент масиву А записати на місце останнього елемента масиву В, 
	другий елемент масиву А записати на місце передостаннього елемента масиву В і т. д.). 
	Вивести обидва масиви та індекси елементів на екран у вигляді 3-х стовпців.*/


	int arr1[SIZE], arr2[SIZE];
	cout << "========COUT  Array 3 ===============" << endl;
	
	for (i = 0; i < SIZE; i++)
	{
		arr1[i] = rand() % 10 + 1;
	}
	//====================================
	for (i = 0; i < SIZE; i++)
	{
		cout << "[" << i << "] " << arr1[i] << endl;
	}
	//===================================

	// Реверс масиву
	int iterator = SIZE - 1;
	for (i = 0; i < SIZE ; i++)
	{
		arr2[i] = arr1[iterator];
		iterator--;
	}
	 //===============================================================

	cout << "========COUT  Array 5 ===============" << endl;

	for (i = 0; i < SIZE; i++)
	{
		cout << "[" << i << "]    " << arr1[i] <<"   " << arr2[i] <<endl;
	}
	cout << "|||||||||||||||||||||||||||||||||||||||||||||||||||||" << endl;



	/*Утворити масив А з 10 вивадкових елементів. Всі парні індекси записаим в масив Б а не парнів масив С. 
	Вивести всі масиви на екран. Після цього посортувати масив Б бульбашкою а масив С вставками*/


	int arr3[SIZE], arrB[SIZE/2], arrC[SIZE/2];
	int x=0, y=0;
	for (int i = 0; i < SIZE; i++)
	{
		arr3[i] = rand() % 10;
		
	}
	
	cout << "========COUT  Array 6 ===============" << endl;
	for (int i = 0; i < SIZE; i++)
	{
		cout << "[" << i << "]    " << arr3[i] << endl;
	}
	cout <<"*************************" <<endl;

	//======================================================================
	//Перевірка парних і непарних індексів
	for (int i = 0; i < SIZE; i++)
	{
		if (i % 2 == 0)
		{
			arrB[x] = arr3[i];
			x++;
		
		}
		else
		{
			arrC[y] = arr3[i];
			y++;
		}


	}

	//======================================================================
	// Вивід на екран двох масивів

	cout << "========COUT  Array 7 ===============" << endl;
	for (int x = 0; x < SIZE/2; x++)
	{
		cout << "[" << x << "]    " << arrB[x] << endl;
	}
	cout << "========COUT  Array 8 ===============" << endl;
	for (int y = 0; y < SIZE / 2; y++)
	{
		cout << "[" << y << "]    " << arrC[y] << endl;
	}


	//=======================================================================

	// Сортування масиву 7 від меншого до більшого методом бульбашка


	cout << "========COUT SORTING (Array 7) \"< \"  Array 9  ===============" << endl;
	for (int i = SIZE/2 - 1; i >= 1; i--)
	{
		for (int j = 0; j < i; j++)
		{
			if (arrB[j] > arrB[j + 1])
			{
				int tmp = 0;
				tmp = arrB[j];
				arrB[j] = arrB[j + 1];
				arrB[j + 1] = tmp;

			}
		}
	}
	cout << "+++++++" << endl;
	for (int i = 0; i < SIZE / 2; i++)
	{
		cout << "[" << i << "]    " << arrB[i] << endl;
	}

	//////////////////////////////////////////////////////////////////

	// Сортування масиву 8 методом вставки
	for (int i = 0; i < SIZE / 2; i++)
	{

		tmp = arrC[i];
		for (j = i - 1; j >= 0 && arrC[j] > tmp; j--)
		{
			arrC[j + 1] = arrC[j];
		}
		arrC[j + 1] = tmp;
	}

	cout << "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!" << endl;

	cout << "========COUT SORTING (Array 8) \"< \"  Array 9  ===============" << endl;
	for (int i = 0; i < SIZE / 2; i++)
	{
		cout << "[" << i << "]    " << arrC[i] << endl;
	}

		system("pause");
		return 0;

}